xcweaver/socialnetwork/evaluation/gcp/2024-08-07_16:40:17/workload.out
Running 5m test @ http://35.198.80.111:12345/wrk2-api/post/compose
  15 threads and 15 connections
  Thread calibration: mean lat.: 21.765ms, rate sampling interval: 58ms
  Thread calibration: mean lat.: 20.054ms, rate sampling interval: 54ms
  Thread calibration: mean lat.: 23.161ms, rate sampling interval: 68ms
  Thread calibration: mean lat.: 22.167ms, rate sampling interval: 60ms
  Thread calibration: mean lat.: 21.954ms, rate sampling interval: 65ms
  Thread calibration: mean lat.: 21.248ms, rate sampling interval: 59ms
  Thread calibration: mean lat.: 24.946ms, rate sampling interval: 60ms
  Thread calibration: mean lat.: 21.348ms, rate sampling interval: 62ms
  Thread calibration: mean lat.: 19.403ms, rate sampling interval: 54ms
  Thread calibration: mean lat.: 22.555ms, rate sampling interval: 68ms
  Thread calibration: mean lat.: 21.141ms, rate sampling interval: 61ms
  Thread calibration: mean lat.: 21.940ms, rate sampling interval: 64ms
  Thread calibration: mean lat.: 21.944ms, rate sampling interval: 70ms
  Thread calibration: mean lat.: 20.313ms, rate sampling interval: 56ms
  Thread calibration: mean lat.: 28.250ms, rate sampling interval: 72ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    12.00s    17.19s    0.99m    81.58%
    Req/Sec     7.67      8.97    33.00     90.06%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.30s 
 75.000%   19.99s 
 90.000%   41.78s 
 99.000%    0.99m 
 99.900%    1.10m 
 99.990%    1.16m 
 99.999%    1.16m 
100.000%    1.16m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      13.063     0.000000            1         1.00
      28.527     0.100000         3424         1.11
      43.423     0.200000         6852         1.25
      78.207     0.300000        10272         1.43
     237.439     0.400000        13695         1.67
    1301.503     0.500000        17120         2.00
    3033.087     0.550000        18830         2.22
    6176.767     0.600000        20542         2.50
   10051.583     0.650000        22254         2.86
   14606.335     0.700000        23966         3.33
   19988.479     0.750000        25684         4.00
   23248.895     0.775000        26536         4.44
   26607.615     0.800000        27392         5.00
   30490.623     0.825000        28247         5.71
   34275.327     0.850000        29104         6.67
   37847.039     0.875000        29958         8.00
   39813.119     0.887500        30387         8.89
   41779.199     0.900000        30815        10.00
   43941.887     0.912500        31248        11.43
   45875.199     0.925000        31671        13.33
   48168.959     0.937500        32097        16.00
   49479.679     0.943750        32318        17.78
   50692.095     0.950000        32534        20.00
   51937.279     0.956250        32743        22.86
   53247.999     0.962500        32956        26.67
   54493.183     0.968750        33167        32.00
   55214.079     0.971875        33275        35.56
   55934.975     0.975000        33386        40.00
   56623.103     0.978125        33490        45.71
   57245.695     0.981250        33599        53.33
   57933.823     0.984375        33702        64.00
   58327.039     0.985938        33756        71.11
   58785.791     0.987500        33809        80.00
   59146.239     0.989062        33867        91.43
   59637.759     0.990625        33916       106.67
   60260.351     0.992188        33970       128.00
   60555.263     0.992969        33996       142.22
   60882.943     0.993750        34023       160.00
   61407.231     0.994531        34050       182.86
   62291.967     0.995313        34077       213.33
   62816.255     0.996094        34103       256.00
   63176.703     0.996484        34117       284.44
   63537.151     0.996875        34131       320.00
   63897.599     0.997266        34143       365.71
   64389.119     0.997656        34156       426.67
   64749.567     0.998047        34171       512.00
   65011.711     0.998242        34177       568.89
   65437.695     0.998437        34184       640.00
   65634.303     0.998633        34190       731.43
   65863.679     0.998828        34196       853.33
   66322.431     0.999023        34203      1024.00
   66846.719     0.999121        34206      1137.78
   67305.471     0.999219        34210      1280.00
   67633.151     0.999316        34213      1462.86
   67829.759     0.999414        34218      1706.67
   68026.367     0.999512        34220      2048.00
   68157.439     0.999561        34221      2275.56
   68419.583     0.999609        34223      2560.00
   68747.263     0.999658        34225      2925.71
   68878.335     0.999707        34227      3413.33
   69009.407     0.999756        34228      4096.00
   69140.479     0.999780        34229      4551.11
   69271.551     0.999805        34230      5120.00
   69337.087     0.999829        34231      5851.43
   69337.087     0.999854        34231      6826.67
   69402.623     0.999878        34232      8192.00
   69468.159     0.999890        34233      9102.22
   69468.159     0.999902        34233     10240.00
   69533.695     0.999915        34234     11702.86
   69533.695     0.999927        34234     13653.33
   69533.695     0.999939        34234     16384.00
   69599.231     0.999945        34236     18204.44
   69599.231     1.000000        34236          inf
#[Mean    =    12003.356, StdDeviation   =    17186.660]
#[Max     =    69533.696, Total count    =        34236]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  35744 requests in 5.00m, 17.55MB read
  Non-2xx or 3xx responses: 1
Requests/sec:    119.14
Transfer/sec:     59.89KB
